
Missing Data (VERY COMMON)

Find missing values in a DataFrame.

In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "David"],
    "age": [25, np.nan, 35, np.nan],
    "salary": [50000, "NA", 70000, 60000]
})

df.head()

      name   age salary
0    Alice  25.0  50000
1      Bob   NaN     NA
2  Charlie  35.0  70000
3    David   NaN  60000

In [5]:
df.isna()

    name    age  salary
0  False  False   False
1  False   True   False
2  False  False   False
3  False   True   False

In [3]:
df.isna().sum()

name      0
age       2
salary    0
dtype: int64

In [4]:
df.isna().any()

name      False
age        True
salary    False
dtype: bool


Fill missing values with mean/median.

In [6]:
df.head(5)

      name   age salary
0    Alice  25.0  50000
1      Bob   NaN     NA
2  Charlie  35.0  70000
3    David   NaN  60000

Replace specific values (e.g., "NA" â†’ np.nan).

In [7]:
df.replace("NA", np.nan, inplace=True)
df.head()

/tmp/ipykernel_252421/1241324615.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.replace("NA", np.nan, inplace=True)

      name   age   salary
0    Alice  25.0  50000.0
1      Bob   NaN      NaN
2  Charlie  35.0  70000.0
3    David   NaN  60000.0

In [9]:
df.isna().sum()

name      0
age       2
salary    1
dtype: int64

Drop rows with missing values.

| Situation                   | Use    |
| --------------------------- | ------ |
| Numeric + symmetric data    | Mean   |
| Numeric + skewed / outliers | Median |
| Categorical                 | Mode   |

In [11]:
df["age"] = df["age"].fillna(df["age"].median())
df.head()

      name   age   salary
0    Alice  25.0  50000.0
1      Bob  30.0      NaN
2  Charlie  35.0  70000.0
3    David  30.0  60000.0